/**
 * Ambition Inc.
 * Copyright (c) 2006-2017 All Rights Reserved.
 */
package com.nuls.io.model.common;

/**
 * 全局返回码汇总
 * @author 晁宇航
 * @version $Id: CodeEnum.java, v 0.1 2017年6月16日 下午6:30:21 晁宇航 Exp $
 */
public enum CodeEnum {
    /**
     * 请求成功
     */
    SUCCESS(0L, "请求成功"),
    /**
     * 服务器内部错误
     */
    ERROR(-1L, "服务器内部错误（500,404）等等"),
    /**
     * 请登录
     */
    ERROR_10000(10000L, "请登录"),
    /**
     * 账号或密码错误
     */
    ERROR_10001(10001L, "账号或密码错误"),
    /**
     * 重复提交
     */
    ERROR_10002(10002L, "重复提交"),
    /**
     * 非法提交
     */
    ERROR_10003(10003L, "非法提交"),
    /**
     * 当前用户没有权限
     */
    ERROR_20001(20001L, "登录用户没有权限"),
    /**
     * http请求验证失败
     */
    ERROR_30001(30001L, "http请求验证失败"),
    /**
     * 文件上传异常
     */
    ERROR_30002(30002L, "文件上传异常"),
    /**
     * 文件下载异常
     */
    ERROR_30003(30003L, "文件下载异常"),
    /**
     * accessKeyId不存在
     */
    ERROR_30004(30004L, "accessKeyId不存在"),
    /**
     * 请求已经过期
     */
    ERROR_30005(30005L, "请求已经过期"),
    /**
     * 未初始化域信息
     */
    ERROR_40000(40000L, "未初始化域信息"),
    /**
     * 角色名称为空
     */
    ERROR_40001(40001L, "角色名称为空"),
    /**
     * 角色名称长度为0~100个字符
     */
    ERROR_40002(40002L, "角色名称长度为0~100个字符"),
    /**
     * 角色信息为空
     */
    ERROR_40003(40003L, "角色信息为空"),
    /**
     * 角色描述为空
     */
    ERROR_40004(40004L, "角色描述为空"),
    /**
     * 角色描述长度为0~100个字符
     */
    ERROR_40005(40005L, "角色描述长度为0~100个字符"),
    /**
     * 角色状态为空
     */
    ERROR_40006(40006L, "角色状态为空"),
    /**
     * 是否是管理员选项为空
     */
    ERROR_40007(40007L, "是否是管理员选项为空"),
    /**
     * 是否是系统默认角色选项为空
     */
    ERROR_40008(40008L, "是否是系统默认角色选项为空"),
    /**
     * 获取单条角色信息失败
     */
    ERROR_40009(40009L, "获取单条角色信息失败"),
    /**
     * 删除单条角色信息失败
     */
    ERROR_40010(40010L, "删除单条角色信息失败"),
    /**
     * 修改用户角色关系的选中状态失败
     */
    ERROR_40011(40011L, "修改用户角色关系的选中状态失败"),
    /**
     * 修改角色资源关系的选中状态失败
     */
    ERROR_40012(40012L, "修改角色资源关系的选中状态失败"),
    /**
     * 资源信息为空
     */
    ERROR_40013(40013L, "资源信息为空"),
    /**
     * 资源类型为空
     */
    ERROR_40014(40014L, "资源类型为空"),
    /**
     * 资源类型长度为0~100个字符
     */
    ERROR_40015(40015L, "资源类型长度为0~100个字符"),
    /**
     * 资源名称为空
     */
    ERROR_40016(40016L, "资源名称为空"),
    /**
     * 资源名称长度为0~100个字符
     */
    ERROR_40017(40017L, "资源名称长度为0~100个字符"),
    /**
     * 资源描述为空
     */
    ERROR_40018(40018L, "资源描述为空"),
    /**
     * 资源描述长度为0~200个字符
     */
    ERROR_40019(40019L, "资源描述长度为0~200个字符"),
    /**
     * 资源URL为空
     */
    ERROR_40020(40020L, "资源URL为空"),
    /**
     * 资源URL长度为0~200个字符
     */
    ERROR_40021(40021L, "资源URL长度为0~200个字符"),
    /**
     * 资源优先级为空
     */
    ERROR_40022(40022L, "资源优先级为空"),
    /**
     * 资源优先级长度为0~100个字符
     */
    ERROR_40023(40023L, "资源优先级长度为0~100个字符"),
    /**
     * 资源状态为空
     */
    ERROR_40024(40024L, "资源状态为空"),
    /**
     * 获取单条资源信息失败
     */
    ERROR_40025(40025L, "获取单条资源信息失败"),
    /**
     * 删除单条资源信息失败
     */
    ERROR_40026(40026L, "删除单条资源信息失败"),
    /**
     * 获取统计超声会诊详情失败
     */
    ERROR_40027(40027L, "获取统计超声会诊详情失败"),
    /**
     *  角色名称已存在
     */
    ERROR_40028(40028L, "角色名称已存在"),
    /**
     * 资源名称已存在
     */
    ERROR_40029(40029L, "资源名称已存在"),
    /**
     * 名称重复
     */
    ERROR_5001(5001L, "名称重复"),
    /**
     * 名称可用
     */
    ERROR_5002(5002L, "名称可用"),
    /**
     * 修改成功
     */
    ERROR_5003(5003L, "修改成功"),
    /**
     * 修改失败
     */
    ERROR_5004(5004L, "修改失败"),
    /**
     * 删除失败,数据错误
     */
    ERROR_5005(5005L, "删除失败,数据错误"),
    /**
     * 新增或修改失败
     */
    ERROR_5006(5006L, "新增或修改失败"),
    /**
     * 名称重复
     */
    ERROR_5007(5007L, "MAC地址重复"),
    /**
     * 删除失败,数据错误或者有子节点不能删除
     */
    ERROR_5008(5008L, "删除失败,数据错误或者有子节点不能删除"),
    /**
     * 没有父联动不能新增或修改子联动
     */
    ERROR_5009(5009L, "没有父联动不能新增或修改子联动"),
    /**
     * 没有传客户端
     */
    ERROR_5010(5010L, "没有传客户端"),
    /**
     * MAC地址长度错误
     */
    ERROR_5011(5011L, "MAC地址长度错误"),
    /**
     * 客户端名称长度1-20个字符
     */
    ERROR_5012(5012L, "客户端名称长度1-20个字符"),
    /**
     * 传入的客户端名称或者客户端ID为空
     */
    ERROR_5013(5013L, "传入的客户端名称或者客户端ID为空"),
    /**
     * 传入的MAC地址或者客户端ID为空
     */
    ERROR_5014(5014L, "传入的MAC地址或者客户端ID为空"),
    /**
     * 传入的自动更新或者文件为空
     */
    ERROR_5015(5015L, "传入的自动更新或者文件为空"),
    /**
     * 传入的文件名为空
     */
    ERROR_5016(5016L, "传入的文件名为空"),
    /**
     * 传入的列表名称或者当前页为空
     */
    ERROR_5017(5017L, "传入的列表名称或者当前页为空"),
    /**
     * 传入的分组信息为空
     */
    ERROR_5018(5018L, "传入的分组信息为空"),
    /**
     * 分组名称长度1-20个字符
     */
    ERROR_5019(5019L, "分组名称长度1-20个字符"),
    /**
     * 分组说明长度1-200个字符
     */
    ERROR_5020(5020L, "分组说明长度1-200个字符"),
    /**
     * 传入的会议为空
     */
    ERROR_5021(5021L, "传入的会议为空"),
    /**
     * 传入的会议名称长度1-50个字符
     */
    ERROR_5022(5022L, "传入的会议名称长度1-50个字符"),
    /**
     * 传入的属性列表为空
     */
    ERROR_5023(5023L, "传入的属性列表为空"),
    /**
     * 传入的用户自定义属性
     */
    ERROR_5024(5024L, "传入的用户自定义属性为空"),
    /**
     * 传入的clientId为空
     */
    ERROR_5025(5025L, "传入的clientId为空"),
    /**
     * 不能修改或删除别人创建的会议
     */
    ERROR_5026(5026L, "不能修改或删除别人创建的会议"),
    /**
     * MAC地址不能为空
     */
    ERROR_5027(5027L, "MAC地址不能为空"),
    /**
     * 客户端名称不能为空
     */
    ERROR_5028(5028L, "客户端名称不能为空"),
    /**
     *分组名称不能为空
     */
    ERROR_5029(5029L, "分组名称不能为空"),
    /**
     *分组内容不能为空
     */
    ERROR_5030(5030L, "分组内容不能为空"),
    /**
     *会议名称不能为空
     */
    ERROR_5031(5031L, "会议名称不能为空"),
    /**
     *会议密码不能为空
     */
    ERROR_5032(5032L, "会议会议密码不能为空"),
    /**
     *传入的会议密码长度6-20个字符
     */
    ERROR_5033(5033L, "传入的会议密码长度6-20个字符"),
    /**
     * 创建会议人的uId不能为空
     */
    ERROR_5034(5034L, " 创建会议人的uId不能为空"),
    /**
     * 属性值不能为空
     */
    ERROR_5035(5035L, " 属性值不能为空"),
    /**
     * 属性ID不能为空
     */
    ERROR_5036(5036L, " 属性ID不能为空"),
    /**
     * 用户ID不能为空
     */
    ERROR_5037(5037L, " 用户ID不能为空"),
    /**
     * 用户名称不能为空并且长度在1-20个字符
     */
    ERROR_5038(5038L, "  用户名称不能为空并且长度在1-20个字符"),
    /**
     * 用户描述不能为空并且长度在1-200个字符
     */
    ERROR_5039(5039L, "  用户描述不能为空并且长度在1-200个字符"),
    /**
     * 登录名不能为空并且长度在1-20个字符
     */
    ERROR_5040(5040L, "  登录名不能为空并且长度在1-20个字符"),
    /**
     *密码不能为空并且长度在6-20个字符
     */
    ERROR_5041(5041L, "  密码不能为空并且长度在6-20个字符"),
    /**
     *角色ID不能为空
     */
    ERROR_5042(5042L, "  角色ID不能为空"),
    /**
     *分组ID不能为空
     */
    ERROR_5043(5043L, "  分组ID不能为空"),
    /**
     *左边对应ID或者类型不能为空
     */
    ERROR_5044(5044L, "  左边对应ID或者类型不能为空"),
    /**
     *用户分组信息不存在
     */
    ERROR_5045(5045L, "  用户分组信息不存在"),
    /**
     * 心跳关键信息不能为空
     */
    ERROR_5046(5046L, "心跳关键信息不能为空"),
    /**
     * 数据库没有对应用户信息
     */
    ERROR_5047(5047L, "数据库没有对应用户信息"),
    /**
     * 账号失效
     */
    ERROR_5048(5048L, "账号失效"),
    /**
     * 没有相应的会诊信息
     */
    ERROR_5049(5049L, "没有相应的会诊信息"),
    /**
     * 服务器上不存在最新版本号
     */
    ERROR_5050(5050L, "服务器上不存在最新版本号"),
    /**
     * 所有公共服务器配置不存在
     */
    ERROR_5051(5051L, "所有公共服务器配置不存在"),
    /**
     *服务器没有相应数据
     */
    ERROR_5052(5052L, "服务器没有相应数据"),
    /**
     * c++没有传mac、loginName、zipName
     */
    ERROR_5053(5053L, "c++没有传mac、loginName、zipName"),
    /**
     * 传入数据错误（patientId、videoId）没有传
     */
    ERROR_5054(5054L, "传入数据错误（patientId、videoId）没有传"),
    /**
     * 传入数据错误（patientId、reportId、videoId、videoLength）没有传！！
     */
    ERROR_5055(5055L, "传入数据错误（patientId、reportId、videoId、videoLength）没有传！！"),
    /**
     * 自定义分组没有配置 例如：allPersonSee，allPersonNoSee，sameGroupRecursion，sameGroupNoRecursion
     */
    ERROR_5056(5056L,
               "自定义分组没有配置 例如：allPersonSee，allPersonNoSee，sameGroupRecursion，sameGroupNoRecursion"),
    /**
     * 传入的MAC地址为空
     */
    ERROR_5057(5057L, "传入的MAC地址为空"),

    /**
    * 列表查询数据不存在
    */
    ERROR_90001(90001L, "查询的数据不存在"),
    /**
     * 列表查询数据不存在
     */
    ERROR_90002(90002L, "URL传入参数为错误值，SQL不能执行！"),
    /**
     * 列表查询数据不存在
     */
    ERROR_90003(90003L, "存在SQL注入风险，请检查！"), ;

    public String getMsg() {
        return msg;
    }

    public Long getCode() {
        return code;
    }

    private CodeEnum(Long code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    private Long   code;
    private String msg;
}
